Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadCombination.Name Property
 Gets or sets the name of the analysis load combination.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnalysisLoadCombination Class
Tekla.Structures.Analysis Namespace